{
  "Artificial Creature": " An artificial creature is a magical construct built from stone, metal or wood, to imitate a living creature. They can be clockwork powered or otherwise animated. This template can be applied to aberrations, beasts, constructs, dragons, humanoids and monstrosities. Type. The creature’s type changes to construct. Immunities. The artificial creature gains immunity poison and psychic damage and to the charmed, exhaustion, frightened, paralyzed, petrified and poisoned conditions. Senses. Unless the creature is blind, or already has better darkvision, it gains darkvision with a range of 60 feet. Challenge. This template does not significantly impact the challenge of a creature. Construct Nature. An artificial creature doesn’t require air, food, drink, or sleep. Languages. The creature understands and, if capable, speaks all languages of its creator instead of its normal languages.",
  "Celestial Creature": " A celestial creature is an extraplanar version of a being normally encountered in the mortal world. Celestial creatures hail from the upper planes. They resemble their natural versions closely aside from a vague impression of divine light surrounding them and golden or silver coloration. This template can be applied to beasts, constructs, dragons, humanoids and monstrosities. Alignment. The creature’s alignment changes to good. It remains unchanged on the chaos/law axis. Type. The creature’s type changes to celestial. Resistances. The celestial creature gains resistance to radiant damage. Immunities. The celestial creature gains immunity to the charmed, exhaustion and frightened conditions. Senses. Unless the creature is blind, or already has better darkvision, it gains darkvision with a range of 60 feet. Languages. The creature understands Celestial and speaks it if it is capable of speech.",
  "Half-Celestials and -Fiends": "Some creatures are the result of a union between a higher form of celestial or fiend and a mortal creature. Use the celestial or fiendish template for these creatures, but the creature also gains a fly speed of 60 feet unless it already has a faster fly speed. Additionally, twice per day as a bonus action, the creature can make a smite attack. If it hits with a melee weapon attack, it deals an additional 9 (2d8) damage to the target. This damage is necrotic if the creature is a half-fiend, or radiant if the creature is a half-celestial.",
  "Elemental Creature": "An elemental creature is an extraplanar version of a creature of the Material Plane. Elemental creatures hail from the elemental realms and resemble their natural version with telltale signs of their elemental nature, such as flames instead of hair, a rocky texture on their skin or a translucent body constantly followed by a breeze, or feeling damp to the touch while hair moves as if the creature is under water. This template can be applied to aberrations, beasts, constructs, dragons, humanoids, and monstrosities. Element. The creature must be associated with one element from air, earth, fire or water. This influences the creature’s statistics Type. The creature’s type changes to elemental. Speed. An elemental creature of air gains a fly speed, an elemental creature of earth gains a burrow speed and an elemental creature of water gains a swim speed equal to its base speed, unless it already has a faster speed of that type. Attacks. An elemental creature of fire deals an additional d4 fire damage with its melee attacks. Damage Vulnerabilities. An elemental creature of fire gains vulnerability to cold damage. Immunities. The elemental creature gains immunity to poison damage and the poisoned condition. An elemental creature of fire also gains immunity to fire damage. Senses. Unless the creature is blind, or already has better darkvision, it gains darkvision with a range of 60 feet. Languages. The creature understands Primordial and speaks the corresponding dialect of its element (Aquan, Auran, Ignan, or Terran) if it is capable of speech. Challenge. This template does not significantly impact the challenge of a creature.",
  "Fiendish Creature": "A fiendish creature is an extraplanar version of a being normally encountered in the mortal world. Fiendish creatures hail from the lower planes. They resemble their natural versions closely aside from dark, usually black or red coloration, as well as eyes and facial orifices glowing with a sinister inner flame. This template can be applied to aberrations, beasts, constructs, humanoids, monstrosities and oozes. Alignment. The creature’s alignment changes to evil. It remains unchanged on the chaos/law axis. Type. The creature’s type changes to fiend. Damage Resistances. The fiendish creature gains resistance to cold and fire damage. Immunities. The fiendish creature gains immunity to poison damage and the poisoned condition. Senses. Unless the creature is blind, or already has better darkvision, it gains darkvision with a range of 60 feet. Languages. The creature understands Infernal or Abyssal and speaks it if it is capable of speech.",
  "Legendary Creature": "Most legendary creatures found in this book and in other publications have very high challenge ratings and only become relevant to high level parties. In some cases, a DM may want to introduce Legendary Creatures at lower levels, for example if the DM wants to be able to field solo enemies against a party of players. In other cases a DM might want to simply give a regular monster or NPC special status, make it into a more appropriate boss encounter, or distinguish it from common members of its species as an exceptional individual. This template can be applied to any type of creature that isn’t already legendary. Legendary Resistance (3/Day). If the creature fails a saving throw, it can choose to succeed instead. Legendary Actions. The creature can take 3 legendary actions, choosing from its legendary action options. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The creature regains spent legendary actions at the start of its turn. Legendary Action Options. Choose 2 to 4 legendary action options from below as are appropriate for the abilities of the creature. Cantrip. (Preresquisites: Ability to cast cantrips) The creature casts a cantrip. Minor Attack*. (Preresquisites: Multiattack either with one attack that is significantly stronger than any other, or with 3 or more attacks) The creature makes a single attack out of the attacks listed in its multiattack (if one of those attacks is significantly stronger than others, use one of the less powerful attacks) or another single attack available to it which is roughly equal in power. Unarmed Strike. The creature makes an unarmed strike attack. The unarmed strike uses the creature’s proficiency bonus to attack rolls and STR or DEX modifier, depending on which is higher, to attack and damage rolls. If the creature is large, instead of 1 damage, it deals 1d4 damage, if it is huge, 2d4 damage, and if it is gargantuan, 4d4 damage. Move. (Preresquisites: Speed over 0 ft.) The creature moves up to its walking speed without provoking Opportunity Attacks. Swim. (Preresquisites: Swimming speed) The creature swims up to half its swimming speed without provoking Opportunity Attacks. Flight. (Preresquisites: Flying speed) The creature moves up to half its flying speed. Detect. The creature makes a Wisdom (Perception) check. Maneuver*. (Preresquisites: Proficiency with Strength (Athletics) or higher Strength than Dexterity score) The creature makes a Shove or Grapple attack. Major Attack (Costs 2 Actions)*. (Preresquisites: Weapon or Spell Attack) The creature makes a single attack listed in its actions which does not qualify as a minor attack. Special Action (Costs 2 Actions)*. (Preresquisites: Special action) The creature uses a special action available to it which it cannot use as part of other actions or as a bonus action with other actions. Parting Blow (Costs 2 Actions)*. The creature makes a single melee attack (as per Minor Attack) and moves up to its speed without provoking opportunity attacks from the target of the attack. Trample (Costs 2 Actions). (Preresquisites: Size Huge or larger) The creature moves up to its walking speed. It may move through but not end its movement in spaces occupied by creatures two or more categories smaller than itself. Each creature in a space it moves through must make a Strength saving throw (DC 8 + creature’s proficiency bonus + creature’s Strength modifier), being knocked prone and taking 2d6 + STR bludgeoning damage on a failed save, or half as much damage on a successful one. Wing Attack (Costs 2 Actions). (Preresquisites: Size Huge or larger, wings, and a flying speed) The creature beats its wings. Each creature within 10 feet must succeed on a Dexterity saving throw (DC 8 + creature’s proficiency bonus + creature’s Strength modifier) or take 2d6 + STR bludgeoning damage and be knocked prone. The creature can then fly up to half its flying speed. An option marked with an asterisk (*) may allow for multiple possible attacks or actions to choose from. In such a case, choose which one when creating the legenary creature. The creature cannot choose a different attack on the fly.",
  "Phantasmal Creature": "A phantasmal creature is a quasi real image of a living creature created by powerful illusion magic. These illusory creatures are visibly different from the natural creature they are imitating, usually appearing translucent and made out of monochromatic light, more like a ghost. It’s attacks are not corporeal but assault the mind of the target instead. This template can be applied to any type of creature. Any equipment carried by the creature is also part of the illusion. Type. The creature’s type changes to construct. Attacks. All damage the phantasmal creature deals with any of its attacks and abilities, including spells, is psychic instead of the damage type it would normally deal. Saving Throws. All saving throws against the creature’s abilities are based on mental abilities (Intelligence, Wisdom or Charisma). Depending on the type of physical ability score normally required, instead use the corresponding mental ability score. Corresponding Ability Scores Physical Ability Corresponding Mental Ability:     \"Strength\": \"Charisma\", \"Dexterity\": \"Intelligence\", \"Constitution\": \"Wisdom\", Acrobatics and Athletics. If a phantasmal creature’s actions or abilities require the target to make a Strength (Athletics) or Dexterity (Acrobatics) check to escape or avoid the effect, those targets make an Intelligence, Wisdom or Charisma save (target’s choice) instead. Death. When a phantasmal creature is destroyed, the illusion dissipates and nothing is left behind. Challenge. The challenge rating of a phantasmal creature is unchanged. Illusory Nature. A phantasmal creature doesn’t require air, food, drink, or sleep."]
}